---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructConnectionColumnTop
source: html/de718924-d211-bf6b-1e9f-88c5ec96236b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructConnectionColumnTop Property

"Top Connection"

## Syntax (C#)
```csharp
public static ForgeTypeId StructConnectionColumnTop { get; }
```